---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.Compare(Autodesk.Revit.DB.WorksetId)
source: html/2161394c-15f2-7a84-54d2-048dba62b269.htm
---
# Autodesk.Revit.DB.WorksetId.Compare Method

Compares two WorksetIds.

## Syntax (C#)
```csharp
public int Compare(
	WorksetId id
)
```

## Parameters
- **id** (`Autodesk.Revit.DB.WorksetId`) - The WorksetId to be compared with this WorksetId.

## Returns
-1 if this WorksetId is less than id, 0 if equal, 1 if greater.